[
    {
        "id":"stn_quest_gyra",
        "name":"Lost girl looking for lost things",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"The little daughter of Odirath the armorer was missed since several days now. You offered to help search for her."
            },
            {
                "progress":20,
                "logText":"Odirath's daughter Gyra was hidden in the storeroom of the main house of the castle. She was surprised by the raid on the castle and no longer dared to leave her hiding place.\nShe was looking for Lord Berbanes helmet, which he had forgotten somewhere in the castle."
            },
            {
                "progress":30,
                "logText":"You offered Gyra to lead her back home safely."
            },
            {
                "progress":40,
                "logText":"Gyra has the feeling that the helmet is very close."
            },
            {
                "progress":50,
                "logText":"You found the helmet."
            },
            {
                "progress":60,
                "logText":"Once back in Stoutford Gyra knew the way and ran to her father Odirath."
            },
            {
                "progress":70,
                "logText":"Odirath thanks you many thousand times.",
                "rewardExperience":2000
            },
            {
                "progress":90,
                "logText":"Lord Berbane slowly took his helmet. Nevertheless, he remained sitting at the table. He probably needs a few more hours without drinks before he can get back to work. If ever.",
                "rewardExperience":200
            },
            {
                "progress":92,
                "logText":"Lord Berbane took his helmet. But somehow that does not really satisfy you.",
                "rewardExperience":200
            },
            {
                "progress":99,
                "logText":"Lord Berbane is singing merrily about his pretended heroic deeds. What a boaster.",
                "rewardExperience":200,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"thorns_vengeance",
        "name":"The thorns of vengeance",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"Aryfora in Stoutford needs my help to prove her uncle, Blornvale, Stoutford's alchemist, killed her father."
            },
            {
                "progress":20,
                "logText":"She needs me to purchase three potions of the brave from Blornvale and return to her."
            },
            {
                "progress":30,
                "logText":"I have returned with the three potions, and gave them to her."
            },
            {
                "progress":40,
                "logText":"She gave me a potion of truth."
            },
            {
                "progress":50,
                "logText":"She wants me to give that potion to Blornvale, and make him confess his crimes. I should have Tahalendor as a witness."
            },
            {
                "progress":60,
                "logText":"I agreed to make Blornvale drink that potion."
            },
            {
                "progress":65,
                "logText":"Tahalendor agreed to go with me to the alchemist's house to hear Blornvale's confession."
            },
            {
                "progress":70,
                "logText":"Blornvale drank the potion.",
                "rewardExperience":1500
            },
            {
                "progress":71,
                "logText":"Tahalendor came to hear Blonvale confession."
            },
            {
                "progress":72,
                "logText":"Blornvale confessed to killing Aryfora's father. Unfortunately there is no witness."
            },
            {
                "progress":74,
                "logText":"Blornvale now understands what you were trying to do. You will no longer be able to help Aryfora get back her shop."
            },
            {
                "progress":76,
                "logText":"It's all your fault that Aryfora is crying now.",
                "rewardExperience":5,
                "finishesQuest":1
            },
            {
                "progress":80,
                "logText":"Blornvale confessed to killing Aryfora's father in the presence of Tahalendor."
            },
            {
                "progress":90,
                "logText":"Aryfora regained her father's shop.",
                "rewardExperience":4000,
                "finishesQuest":1
            }
        ]
    }
]